#pragma once

//---------------------------------------------------------------------------------
//	定数:
//	 画面サイズ、プレイヤー、プレイヤーの弾、ビット、ビットマーカー,マーカーマネージャー関連
//   エネミー、エネミーの弾、その他(単一でいいもの等)
//---------------------------------------------------------------------------------


//-----------------------------------------
//	画面サイズ
//-----------------------------------------

//! @brief 画面の幅
const int WINDOW_WIDTH = 256;
//! @brief 画面の高さ
const int WINDOW_HEIGHT = 240;

//! @brief 画面の半分の幅
const int WINDOW_WIDTH_HALF = WINDOW_WIDTH / 2;
//! @brief 画面の半分の高さ
const int WINDOW_HEIGHT_HALF = WINDOW_HEIGHT / 2;

//-----------------------------------------
//	マップ
//-----------------------------------------

//! @brief マップの列(幅)
const int MAP_COL = 211;
//! @brief マップの行(高さ)
const int MAP_ROW = 15;
//! @brief マップデータの最大数
const int MAP_DATA_NUM = 1;

//! @brief ステージ1の長さ
const int STAGE_1_LENGTH = 3376;

//-----------------------------------------
//	ブロック
//-----------------------------------------

constexpr int BLOCK_SIZE = 16;

//! @brief ブロックの上限数
constexpr int BLOCK_MAX = 4000;

//-----------------------------------------
//	エネミー
//-----------------------------------------

//! @brief エネミーの上限数
constexpr int ENEMY_MAX = 120;

//-----------------------------------------
//	その他(単一でいいもの等)
//-----------------------------------------

//! @brief オブジェクトの上限数
const int OBJECT_MAX = 8000;

//! @brief 保存できる音源の数
const int SOUND_INFO_LENGTH = 20;

//! @brief 保存できる画像の数
const int IMAGE_INFO_LENGTH = 128;
//! @brief 画像の拡大率
const int IMAGE_RATE = 1.0f;

