#include "GroundBlock.h"
#include "Camera.h"

#include<DxLib.h>

//---------------------------------------------------------------------------------
//	GroundBlockの処理
//---------------------------------------------------------------------------------
GroundBlock::~GroundBlock()
{
}

//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------   
void GroundBlock::update()
{
}

//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GroundBlock::render()
{
	// カメラのオフセットを考慮して、ワールド座標をスクリーン座標に変換
    float drawX = Camera::getInstance().worldToScreenX(pos.x);

	// 四角形の左上と右下の座標を整数に変換
    int x1 = (int)drawX;
    int y1 = (int)pos.y;
    int x2 = (int)(drawX + size.x);
    int y2 = (int)(pos.y + size.y);

    // 地面は分かりやすく白（255, 255, 255）で枠線を描く例
    DrawBox(x1, y1, x2, y2, GetColor(255, 0, 0), TRUE);
}
