#include "Object.h"

//---------------------------------------------------------
// Objectの処理
//---------------------------------------------------------



//---------------------------------------------------------
// コンストラクタ
//---------------------------------------------------------
Object::Object(int _id, OBJECT_TYPE _objectType)
{
	// IDは引数で貰ったIDに
	id = _id;

	objectType = _objectType;

	// 状態はREADYから開始
	objectState = OBJECT_STATE::READY;

}

//---------------------------------------------------------
// デストラクタ
//---------------------------------------------------------
Object::~Object()
{

}

//---------------------------------------------------------
// オブジェクトのIDを取得する関数
//---------------------------------------------------------
int Object::getObjectId()
{
	return id;
}

//---------------------------------------------------------
// オブジェクトの状態を取得する関数
//---------------------------------------------------------
int Object::getObjectState()
{
	return objectState;
}

//---------------------------------------------------------
// オブジェクトの型を取得する関数
//---------------------------------------------------------
OBJECT_TYPE Object::getObjectType()
{
	return objectType;
}

//---------------------------------------------------------
// オブジェクトの初回起動時に実行される処理関数
//---------------------------------------------------------
bool Object::activate()
{
	// レディの時だけACTIVEになるように
	if (!(objectState < OBJECT_STATE::ACTIVE))
	{
		return false;
	}

	// 初回実行時にしてほしい処理内容を呼ぶ
	activateProc();

	// 状態をACTIVE
	objectState = OBJECT_STATE::ACTIVE;

	return true;
}


//---------------------------------------------------------
// オブジェクトの死亡時に実行される処理関数
//---------------------------------------------------------
bool Object::deactivate()
{
	// 未満なら何もしない
	if (!(objectState < OBJECT_STATE::INACTIVE))
	{
		return false;
	}

	// 死亡時にしてほしい処理内容を呼ぶ
	deactiveProc();

	// 状態を死亡状態にする
	objectState = OBJECT_STATE::INACTIVE;

	return true;
}