#include "Player.h"
#include "Camera.h"

#include<DxLib.h>

//---------------------------------------------------------------------------------
//	プレイヤーの処理
//---------------------------------------------------------------------------------

//---------------------------------------------------------------------------------
// コンストラクタ
//---------------------------------------------------------------------------------
Player::Player(int _id) : Object(_id, PLAYER)
{
	pos.x = 100.0f;
	pos.y = 50.0f;
	size.x = size.y = 16.0f;
	movSpeed.x = 0.0f;
	movSpeed.y = 0;

	// 最初は空中から始まるので「落下中」スタートにする
	// 移動ステートの登録
	moveState.add(GROUND, &Player::initGround, &Player::updateGround, &Player::exitGround);
	moveState.add(JUMP, &Player::initJump, &Player::updateJump, &Player::exitJump);
	moveState.add(FALL, &Player::initFall, &Player::updateFall, &Player::exitFall);

	moveState.change(FALL);
}

//---------------------------------------------------------------------------------
// デストラクタ
//---------------------------------------------------------------------------------
Player::~Player()
{
}

//---------------------------------------------------------------------------------
// 更新処理
//---------------------------------------------------------------------------------
void Player::update()
{
	// 状態の更新
	moveState.update(this);
	formState.update(this);
	effectState.update(this);
}

//---------------------------------------------------------------------------------
// 描画処理
//---------------------------------------------------------------------------------
void Player::render()
{
	float drawX = Camera::getInstance().worldToScreenX(pos.x);
	DrawBox(drawX, pos.y, drawX + size.x, pos.y + size.y, 0xFF0000, TRUE);
}

//---------------------------------------------------------------------------------
// 地面に接地した時の処理
//---------------------------------------------------------------------------------
void Player::onLand(float groundY)
{
	// 位置を床のピッタリ上に合わせる
	pos.y = groundY - size.y;

	// 縦の速度をリセット
	movSpeed.y = 0.0f;

	// 移動ステートを GROUND に変更
	moveState.change(GROUND);
}

//---------------------------------------------------------------------------------
// 地面に接地している時の初期化処理
//---------------------------------------------------------------------------------
void Player::initGround()
{
}

//---------------------------------------------------------------------------------
// 地面に接地している時の処理
//---------------------------------------------------------------------------------
void Player::updateGround()
{
	// 横移動
	movSpeed.x = 0.0f;
	if (CheckHitKey(KEY_INPUT_D)) movSpeed.x = 2.0f;
	if (CheckHitKey(KEY_INPUT_A))  movSpeed.x = -2.0f;
	pos.x += movSpeed.x;

	// 着地判定がないので、とりあえず常にFALLへ移行する予備判定を入れる
    // 実際にはCollisionManagerで「床に触れていたらGROUND」にする
    // ここでは「床に触れていないならFALLへ遷移」という仕組みを作る
	moveState.change(FALL);

	// ジャンプ
	if (CheckHitKey(KEY_INPUT_SPACE)) {
		moveState.change(JUMP);
	}

}

//---------------------------------------------------------------------------------
// 地面に接地している時の終了処理
//---------------------------------------------------------------------------------
void Player::exitGround()
{
}

//---------------------------------------------------------------------------------
// ジャンプ中の初期化処理
//---------------------------------------------------------------------------------
void Player::initJump()
{
	movSpeed.y = -8.0f;
}

//---------------------------------------------------------------------------------
// ジャンプ中の処理
//---------------------------------------------------------------------------------
void Player::updateJump()
{
	movSpeed.y += 0.5f; // 重力
	pos.y += movSpeed.y;
	pos.x += movSpeed.x;

	if (movSpeed.y >= 0.0f) moveState.change(FALL);
}

//---------------------------------------------------------------------------------
// ジャンプ中の終了処理
//---------------------------------------------------------------------------------
void Player::exitJump()
{

}

//---------------------------------------------------------------------------------
// 落下中の初期化処理
//---------------------------------------------------------------------------------
void Player::initFall()
{

}

//---------------------------------------------------------------------------------
// 落下中の処理
//---------------------------------------------------------------------------------
void Player::updateFall()
{
	movSpeed.y += 0.5f; // これが動いていないと重力がない
	if (movSpeed.y > 8.0f) movSpeed.y = 8.0f;
	pos.y += movSpeed.y;

	pos.x += movSpeed.x;
}

//---------------------------------------------------------------------------------
// 落下中の終了処理
//---------------------------------------------------------------------------------
void Player::exitFall()
{
}

//---------------------------------------------------------------------------------
// 小さい状態での更新処理
//---------------------------------------------------------------------------------
void Player::updateLow()
{
}

//---------------------------------------------------------------------------------
// 大きい状態での更新処理
//---------------------------------------------------------------------------------
void Player::updateTall()
{
}
