#include "Title.h"
#include "ObjectManager.h"
#include "ImageManager.h"
#include "SceneManager.h"
#include "SoundManager.h"
#include "MapManager.h"

#include "Camera.h"
#include "PlayerManager.h"
#include "Player.h"

#include "CollisionManager.h"

#include <DxLib.h>


//=================================================================================
//	タイトルシーンの処理
//=================================================================================


//---------------------------------------------------------------------------------
//	コンストラクタ
//---------------------------------------------------------------------------------
Title::Title()
{
	init();
}
//---------------------------------------------------------------------------------
//	デストラクタ
//---------------------------------------------------------------------------------
Title::~Title()
{
	exit();
}
//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Title::init()
{
	// 次のシーンは未設定(-1)にしておく
	nextScene = -1;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Title::update()
{
	ObjectManager* pOM = ObjectManager::getInstance();

	// シーンマネージャーのインスタンスを取得
	SceneManager* pSceneManager = SceneManager::getInstance();

	SoundManager* pSoundManager = SoundManager::getInstance();


	if (CheckHitKey(KEY_INPUT_RETURN)) {
		nextScene = SceneManager::SCENE_STAGE;
	}
	

	if (0 < nextScene) {
		pSceneManager->changeScene(nextScene);
	}

}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Title::render()
{
	DrawString(70, 112, "PUSH TO RETURN", 0xFFFFFF);
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Title::exit()
{

}
